--[[ 
▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                                ▀▄ ▄▀ 
▀▄ ▄▀       BY Reda     @Reda999                 ▀▄ ▄▀ 
▀▄ ▄▀                                       ▀▄ ▄▀          
▀▄ ▄▀       @Reda999                      ▀▄ ▄▀   
▀▄ ▄▀            مساعدة 2                 ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
▀--]]
do

local function leader(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'م1' then
local S = [[ 
   💡سِوَرَسِ Řφđέ 💡
💢 أّوٌأّمًر حًمًأّيِّةّ أّلَمًجّـمًوٌعٌةّ 💢
🎌✨🎌✨🎌✨🎌✨
💢طِردٍ 👟<مًعٌرفُـ-ردٍ> : لَطِردٍ عٌضًـوٌ | ⛔️
💢کْتٌـمً 😑<مًعٌرفُـ-ردٍ> : کْتٌـمً عٌضًـوٌ | 🔕
💢حًظُر ✋<مًعٌرفُـ-ردٍ> : حًظُر عٌضًـوٌ | 🚷
💢الغاء الحظر <مًعٌرفُـ-ردٍ> : أّلَغُأّء أّلَحًظُر | ⭕️
💢قُأّئمًةّ أّلَمًحًظُوٌريِّنِ : أّلَمًحًظُوٌريِّنِ | 🆘
💢أّيِّدٍيِّ : مًعٌرفُـةّ أّيِّدٍيِّکْ | 🆔
💢مغادرة : مغادرة | 🚫
🎌✨🎌✨🎌✨🎌✨
💢أّوٌأّمًر أّلَفُـتٌـحً وٌأّلَقُفُـلَ فُـيِّ أّلَمًجّـمًوٌعٌةّ | ✂️
🎌✨🎌✨🎌✨🎌✨
💢طِريِّقُةّ أّسِـتٌـخِـدٍأّمً أّلَأّوٌأّمًر
💢 قُفُـلَ🔒 + أّلَأّمًر - لَلَقُفُـل 🔒َ
💢 فُـتٌـحً🔓 + أّلَأّمًر - لَلَفُـتٌـحًً 🔓
🎌✨🎌✨🎌✨🎌✨
💢 قُفُـلَ الصّـوٌتٌـيِّأّتٌـ : لَمًنِعٌ أّلَصّـوٌتٌـيِّأّتٌـ | 🔊
💢 قُفُـلَ أّلَمًتٌـحًرکْةّ: لَمًنِعٌ أّلَصّـوٌر مًتٌـحًرکْةّ | 🎡
💢 قُفُـلَ أّلَمًلَفُـأّتٌـ : لَمًنِعٌ أّلَمًلَفُـأّتٌـ | 🗂
💢قُفُـلَ أّلَصّـوٌر :لَمًنِعٌ أّلَصّـوٌر | 🌠
💢قُفُـلَ أّلَکْتٌـأّبًةّ :لمنع أّلَکْتٌـأّبًةّ | 📝
💢قُفُـلَ أّلَفُـيِّدٍيِّوٌهّـأّتٌـ : لَمًنِعٌ أّلَفُـيِّدٍيِّوٌ | 🎥
💢قُفُـلَ أّلَتٌـوٌجّـيِّةّ : لَمًنِعٌ أّعٌأّدٍةّ تٌـوٌجّـيِّهّـ | ↩️
💢قُفُـلَ أّلَتٌـکْرأّر : مًنِعٌ أّلَتٌـکْرأّر | 🔐
💢قُفُـلَ أّلَبًوٌتٌـأّتٌـ : لَمًنِعٌ بًوٌتٌـأّتٌـ أّلَتٌـفُـلَيِّشُـ وٌغُيِّرهّـأّ | 🤖
💢قُفُـلَ أّلَروٌأّبطِ : لَمًنِعٌ أّلَروٌأّبًطِ | 🔗
💢قُفُـلَ أّلَأّضًـأّفُـةّ : لَمًنِعٌ أّلَأّضًـأّفُـةّ | 👤
💢قُفُـلَ أّلَأّضًـأّفُـةّ أّلَجّـمًأّعٌيِّةّ : لَمًنِعٌ أّلَأّضًـأّفُـةّ أّلَجّـمًأّعٌيِّةّ | 🚸
💢قُفُـلَ أّشُـعٌأّرأّتٌـ  :  أّشُـعٌأّرأّتٌـ أّلَدٍخِـوٌلَ | ⚛ 
💢قُفُـلَ جّـهّـأّتٌـ أّلَأّتٌـصّـأّلَ : جّـهّـأّتٌـ أّلَأّتٌـصّـأّلَ | 📞
💢قُفُـلَ أّلَتٌـفُـلَيِّشُـ : لَمًنِعٌ الرسِـأّئلَ أّلَطِوٌيِّلَهّـ | 📊
💢قُفُـلَ أّلَمًحًأّدٍثًـةّ : لَمًنِعٌ أّلَمًحًأّدٍثًـةّ | 📧
💢قُفُـلَ أّلَعٌربًيِّةّ :  أّلَلَغُةّ أّلَعٌربًيِّةّ | 🆎
💢قُفُـلَ أّلَتٌـحًذِيِّر : أّلَحًمًأّيِّةّ | 🔏️
🎌✨🎌✨🎌✨🎌✨
💢️ #DΣV @Reda999 
💢️ #BӨT @city5_bot
💢️@Reda999 ➪مطور الســورس
]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "شغلة مال كبار لتدخل انت😂"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م1)$",
},
run = leader 
}
end
