--[[ تم التعطيل والتعريب بواسطه @xXxDev_iqxXx

  _____              _           
|  ___|_ _  ___  __| | ___ _ __ 
| |_ / _` |/ _ \/ _` |/ _ \ '__|
|  _| (_| |  __/ (_| |  __/ |   
|_|  \__,_|\___|\__,_|\___|_|   
                    
--]]
do
function run(msg, matches)
 if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔹أهلا وسهلا 🙇🏻💕

🔹توجد ثلاثة قوائم للاوامر    

🔹تستخدم الاوامر بدون [/!#]

🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹- م1 === اوامر ادارة المجموعة

🔹- م2 === اوامر حماية المجموعة

🔹- م مطور === الاوامر الخاصة بالمطور 
]].."\n"
.."🔹➖🔸➖🔹➖🔸➖🔹➖🔸".."\n"
..'♦️Dev @xXxDev_iqxXx ☠ '..'\n'
..'♦️channel : @Team_faeder  ☠ '..'\n'
..' ♦️Bot @ll750kll_bot ☠ '..'\n'
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
    🔹اوامر ادارة المجموعات 🔹
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹معلوماتي : معلومات العضو | 📃
🔹معلومات المجموعة : معلومات الكروب | 💢
🔹الاعدادات : الاعدادات | ⚙
🔹موقعي : موقعك في المجموعة | 🏌
🔹الاعضاء : قائمة الاعضاء | 👥
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹رفع ادمن : رفع ادمن | ➕
🔹تنزيل ادمن : تنزيل ادمن | ✖️
🔹الادمنيه : قائمة الادمنية | 👥
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹الرابط : رابط الكروب | 🔗
🔹وضع رابط : وضع رابط | 📌
🔹رابط جديد : : رابط جديد | 🆕
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹ضع قوانين  + وضع قوانين : القوانين | ⚙
🔹القوانين  : رؤية القوانين | 👁
🔹ضع وصف  + وضع وصف : الوصف | 🔧
🔹ضع اسم  + وضع اسم : اسم | 🎫
🔹ضع صورة  : وضع صوره | 🎡
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹حذف  ↴ حذف ⛔️
🔹الادمنية : الادمنية | 👥
🔹الوصف : الوصف | 📃
🔹المكتومين : المكتومين | 🗣
🔹القوانين :  القوانين | 🎌
]].."\n"
.."🔹➖🔸➖🔹➖🔸➖🔹➖🔸".."\n"
..'♦️Dev @xXxDev_iqxXx ☠ '..'\n'
..'♦️channel : @Team_faeder  ☠ '..'\n'
..' ♦️Bot @ll750kll_bot ☠ '..'\n'
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹طرد <معرف-رد> : طرد | ⛔️
🔹كتم <معرف-رد> : كتم | 🔕
🔹حظر <معرف-رد> : حظر | 🚷
🔹الغاء الحظر <معرف-رد> : الغاء الحظر | ⭕️
🔹قائمة الحظر : المحظورين | 🆘
🔹ايدي : ايدي | 🆔
🔹مغادرة : مغادرة | 🚫
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹اوامر الفتح والقفل في المجموعة | ✂️
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹قفل الصوتيات : لمنع الصوتيات | 🔊
🔹قفل المتحركة : لمنع المتحركة | 🎡
🔹قفل الملفات : لمنع الملفات | 🗂
🔹قفل الصور :لمنع الصور | 🌠
🔹قفل الكتابة :لمنع الكتابة | 📝
🔹قفل الفيديوهات : لمنع الفديوات | 🎥
🔹قفل التوجية : لمنع التوجيه | ↩️
🔹قفل التكرار : لمنع التكرار | 🔐
🔹قفل البوتات : لمنع البوتات | 🤖
🔹قفل الروابط : لمنع الروابط | 🔗
🔹قفل الاضافة : لمنع الاضافة | 👤
🔹قفل الاضافة الجماعية : لمنع الاضافة الجماعية | 🚸
🔹قفل اشعارات  :  اشعارات الدخول | ⚛ 
🔹قفل جهات اتصال : جهات الاتصال | 📵
🔹قفل التفليش : لمنع الكلايش الطويله | 📊
🔹قفل المحادثة : لمنع المحادثة | 🔕
🔹قفل العربيه :  اللغة العربية | 🆎
🔹قفل التعديل + اضافه هذا البوت @Hdidnebot لمنع التعديل  | 🔕
🔹قفل التحذير : الحماية | ⛔️
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹طريقة استخدام الاوامر 🔹
🔹 قفل + الامر - للقفل
🔹 فتح + الامر - للفتح
]].."\n"
.."🔹➖🔸➖🔹➖🔸➖🔹➖🔸".."\n"
..'♦️Dev @xXxDev_iqxXx ☠ '..'\n'
..'♦️channel : @Team_faeder  ☠ '..'\n'
..' ♦️Bot @ll750kll_bot ☠ '..'\n'
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
  },
  run = run
}
end
