do 

function run(msg, matches) 
return [[ 
🚁 ـ يعمل البوت على مجموعات سوبر كروب تصل الى 5k عضو !
🚀 - البوت شغال طوال الوقت دون توقف

#قناة_البوت @Team_faeder
🚯❗️ #مطور_البوت : @xXxDev_iqxXx
#بوت_التواصل @ll750kll_bot
�
]] 
end 

return { 
description = "Shows bot q", 
usage = "spam Shows bot q", 
patterns = { 
"^(المطور)$", 
}, 
run = run 
} 
end 


--[[ تم التعطيل والتعريب بواسطه @xXxDev_iqxXx

  _____              _           
|  ___|_ _  ___  __| | ___ _ __ 
| |_ / _` |/ _ \/ _` |/ _ \ '__|
|  _| (_| |  __/ (_| |  __/ |   
|_|  \__,_|\___|\__,_|\___|_|   
                    
--]]