do 

function run(msg, matches) 
return [[ 
💢أﮪــــلُا ﭘــــګ عـزيـــزي💢

🔰ﭬـــﯥ بــؤټ ﺣﻣـايـة اﻟکروبات (api) تـــم ﺻﻧـاعــة اﻟـﺑـؤټ ﺑـوآﺳـطــة 🔰                                           
🛃الــمـطــوريــن🛃
 
🎗●• • • • • •♦• • • • • •●🎗

Name |【℡☻➥┇ȷ̈ɹබ̈ɹɹɹɹם
Phone| 9647725106418
Dev    | @KS_iq

🎗●• • • • • •♦• • • • • •●🎗

Name |【℡☻➥┇رضـــــا
Phone| 9647815673446
Dev    | @Reda999


🎗●• • • • • •♦• • • • • •●🎗
 5K يـعـﻣـل اﻟﺑـﻭټ ﻋﻟﻰ كروبات 
BotTaoasl | @city5_bot
🎗●• • • • • •♦• • • • • •●🎗
]] 
end 

return { 
description = "Shows bot q", 
usage = "spam Shows bot q", 
patterns = { 
"^(المطور)$", 
}, 
run = run 
} 
end 


--[[ تم التعطيل والتعريب بواسطه @xXxDev_iqxXx

  _____              _           
|  ___|_ _  ___  __| | ___ _ __ 
| |_ / _` |/ _ \/ _` |/ _ \ '__|
|  _| (_| |  __/ (_| |  __/ |   
|_|  \__,_|\___|\__,_|\___|_|   
                    
--]]
